### Pandas DataFrame and Series

In [1]:
import pandas as pd;
import numpy as np;

In [2]:
df1 = pd.DataFrame({"A": [1.0, np.nan, 3.0, 5.0, np.nan], "B": [np.nan, 2.0, 3.0, np.nan, 6.0]})
df2 = pd.DataFrame({"A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],"B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],})

In [3]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [4]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [5]:
df1.combine_first(df2)   #select value form df2 for an index if df1 has nan at that index otherwise select the df1 value.

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [6]:
df2.combine_first(df1)

     A    B
0  5.0  NaN
1  2.0  2.0
2  4.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [9]:
pd.Series([34,53,23,np.nan]).combine_first(pd.Series([84,40,25,63]))

0    34.0
1    53.0
2    23.0
3    63.0
dtype: float64

In [11]:
np.array(df1)

array([[ 1., nan],
       [nan,  2.],
       [ 3.,  3.],
       [ 5., nan],
       [nan,  6.]])

In [14]:
pd.isna(df1)

       A      B
0  False   True
1   True  False
2  False  False
3  False   True
4   True  False

In [38]:
df1.loc[5]=[4.0,np.nan]

In [39]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0
5  4.0  NaN

In [40]:
np.where(pd.isna(df1), df2, df1)

array([[ 1., nan],
       [ 2.,  2.],
       [ 3.,  3.],
       [ 5.,  4.],
       [ 3.,  6.],
       [ 4.,  8.]])

In [41]:
def combiner(a,b):
    return np.where(pd.isna(a), b, a);

df1.combine(df2, combiner)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  4.0  8.0

In [43]:
df = pd.DataFrame(np.random.randint(1,100,(10,3)), index=range(1,11), columns=['A','B','C']);
df

     A   B   C
1   37  29  94
2   79  75  15
3   83   5  39
4   34  97  15
5    5   9  44
6   76  23   4
7   75  40  45
8   84  21  55
9   98  59  76
10  46  61  54

In [44]:
df.mean()

A    61.7
B    41.9
C    44.1
dtype: float64

In [45]:
df.std()

A    29.416737
B    30.178911
C    27.993849
dtype: float64

In [46]:
df.mean(axis=1)

1     53.333333
2     56.333333
3     42.333333
4     48.666667
5     19.333333
6     34.333333
7     53.333333
8     53.333333
9     77.666667
10    53.666667
dtype: float64

In [48]:
df.mean(axis='columns')

1     53.333333
2     56.333333
3     42.333333
4     48.666667
5     19.333333
6     34.333333
7     53.333333
8     53.333333
9     77.666667
10    53.666667
dtype: float64

In [49]:
df.mean(axis='index')

A    61.7
B    41.9
C    44.1
dtype: float64

In [51]:
df.sum()

A    617
B    419
C    441
dtype: int64

In [52]:
df.sum(axis=1)

1     160
2     169
3     127
4     146
5      58
6     103
7     160
8     160
9     233
10    161
dtype: int64

In [54]:
df.loc[10]=np.nan

In [55]:
df

       A     B     C
1   37.0  29.0  94.0
2   79.0  75.0  15.0
3   83.0   5.0  39.0
4   34.0  97.0  15.0
5    5.0   9.0  44.0
6   76.0  23.0   4.0
7   75.0  40.0  45.0
8   84.0  21.0  55.0
9   98.0  59.0  76.0
10   NaN   NaN   NaN

In [57]:
df.sum(axis='index', skipna=True)

A    571.0
B    358.0
C    387.0
dtype: float64

In [58]:
df.sum(axis='columns', skipna=False)

1     160.0
2     169.0
3     127.0
4     146.0
5      58.0
6     103.0
7     160.0
8     160.0
9     233.0
10      NaN
dtype: float64

In [59]:
df.sum(skipna=False)

A   NaN
B   NaN
C   NaN
dtype: float64

In [60]:
ts_stand = (df-df.mean())/df.std()

In [61]:
ts_stand

           A         B         C
1  -0.862854 -0.345352  1.731053
2   0.507561  1.128625 -0.950382
3   0.638077 -1.114384 -0.135769
4  -0.960741  1.833571 -0.950382
5  -1.906980 -0.986212  0.033942
6   0.409674 -0.537610 -1.323746
7   0.377046  0.007121  0.067884
8   0.670706 -0.601696  0.407307
9   1.127511  0.615937  1.120093
10       NaN       NaN       NaN

In [62]:
ts_stand.std()

A    1.0
B    1.0
C    1.0
dtype: float64

In [66]:
df

       A     B     C
1   37.0  29.0  94.0
2   79.0  75.0  15.0
3   83.0   5.0  39.0
4   34.0  97.0  15.0
5    5.0   9.0  44.0
6   76.0  23.0   4.0
7   75.0  40.0  45.0
8   84.0  21.0  55.0
9   98.0  59.0  76.0
10   NaN   NaN   NaN

In [63]:
df.mean(1)

1     53.333333
2     56.333333
3     42.333333
4     48.666667
5     19.333333
6     34.333333
7     53.333333
8     53.333333
9     77.666667
10          NaN
dtype: float64

In [65]:
df.sub(df.mean(1), axis=0)

            A          B          C
1  -16.333333 -24.333333  40.666667
2   22.666667  18.666667 -41.333333
3   40.666667 -37.333333  -3.333333
4  -14.666667  48.333333 -33.666667
5  -14.333333 -10.333333  24.666667
6   41.666667 -11.333333 -30.333333
7   21.666667 -13.333333  -8.333333
8   30.666667 -32.333333   1.666667
9   20.333333 -18.666667  -1.666667
10        NaN        NaN        NaN

In [68]:
xs_stand = (df.sub(df.mean(1), axis=0)).div(df.std(1), axis=0);
xs_stand

           A         B         C
1  -0.460811 -0.686514  1.147324
2   0.632237  0.520666 -1.152902
3   1.039890 -0.954653 -0.085237
4  -0.341702  1.126063 -0.784361
5  -0.668053 -0.481620  1.149673
6   1.116650 -0.303729 -0.812921
7   1.144586 -0.704361 -0.440225
8   0.972525 -1.025379  0.052855
9   1.039890 -0.954653 -0.085237
10       NaN       NaN       NaN

In [70]:
xs_stand.std(1)

1     1.0
2     1.0
3     1.0
4     1.0
5     1.0
6     1.0
7     1.0
8     1.0
9     1.0
10    NaN
dtype: float64

In [71]:
df.count()

A    9
B    9
C    9
dtype: int64

In [72]:
df.count(1)

1     3
2     3
3     3
4     3
5     3
6     3
7     3
8     3
9     3
10    0
dtype: int64

In [73]:
df.mad()      # Mean Absolute Diviation

C:\Users\ABBAS\AppData\Local\Temp\ipykernel_7100\3844944795.py:1: FutureWarning: The 'mad' method is deprecated and will be removed in a future version. To compute the same result, you may do `(df - df.mean()).abs().mean()`.
  df.mad()

A    25.407407
B    24.864198
C    22.000000
dtype: float64

In [76]:
(df-df.mean()).abs().mean()

A    25.407407
B    24.864198
C    22.000000
dtype: float64

In [77]:
(df-df.mean()).abs().mean(1)

1     29.407407
2     26.259259
3     19.444444
4     38.222222
5     30.074074
6     22.777778
7      4.592593
8     17.111111
9     28.925926
10          NaN
dtype: float64

In [79]:
df.median()

A    76.0
B    29.0
C    44.0
dtype: float64

In [80]:
df.mean()

A    63.444444
B    39.777778
C    43.000000
dtype: float64

In [81]:
df.median(1)

1     37.0
2     75.0
3     39.0
4     34.0
5      9.0
6     23.0
7     45.0
8     55.0
9     76.0
10     NaN
dtype: float64

In [82]:
df.mean(1)

1     53.333333
2     56.333333
3     42.333333
4     48.666667
5     19.333333
6     34.333333
7     53.333333
8     53.333333
9     77.666667
10          NaN
dtype: float64

In [83]:
df.min()

A    5.0
B    5.0
C    4.0
dtype: float64

In [84]:
df.max()

A    98.0
B    97.0
C    94.0
dtype: float64

In [85]:
df.std()

A    30.647639
B    31.208083
C    29.461840
dtype: float64

In [87]:
df.var()

A    939.277778
B    973.944444
C    868.000000
dtype: float64

In [88]:
df.abs()

       A     B     C
1   37.0  29.0  94.0
2   79.0  75.0  15.0
3   83.0   5.0  39.0
4   34.0  97.0  15.0
5    5.0   9.0  44.0
6   76.0  23.0   4.0
7   75.0  40.0  45.0
8   84.0  21.0  55.0
9   98.0  59.0  76.0
10   NaN   NaN   NaN

In [89]:
df.mode()

      A     B     C
0   5.0   5.0  15.0
1  34.0   9.0   NaN
2  37.0  21.0   NaN
3  75.0  23.0   NaN
4  76.0  29.0   NaN
5  79.0  40.0   NaN
6  83.0  59.0   NaN
7  84.0  75.0   NaN
8  98.0  97.0   NaN

In [90]:
df.prod()

A    1.935245e+15
B    1.082188e+13
C    2.730715e+13
dtype: float64

In [91]:
df.sem()    # standard error of the mean

A    10.215880
B    10.402694
C     9.820613
dtype: float64

In [92]:
df.skew()   #Sample skewness (3rd moment)

A   -0.999011
B    0.816144
C    0.421304
dtype: float64

In [94]:
df.kurt()   #Sample kurtosis (4th moment)

A   -0.090185
B   -0.342929
C   -0.477659
dtype: float64

In [95]:
df.quantile()   #Sample quantile (value at %)

A    76.0
B    29.0
C    44.0
Name: 0.5, dtype: float64

In [96]:
df.cummin()

       A     B     C
1   37.0  29.0  94.0
2   37.0  29.0  15.0
3   37.0   5.0  15.0
4   34.0   5.0  15.0
5    5.0   5.0  15.0
6    5.0   5.0   4.0
7    5.0   5.0   4.0
8    5.0   5.0   4.0
9    5.0   5.0   4.0
10   NaN   NaN   NaN

In [97]:
series = pd.Series(np.random.randn(500))
series

0     -1.135462
1      0.815127
2     -2.549870
3     -0.063844
4     -0.385821
         ...
495   -0.067271
496    0.747103
497    0.176395
498   -2.279711
499    0.516934
Length: 500, dtype: float64

In [101]:
series[30:500]=np.nan;

In [102]:
series[15:30]=30;

In [105]:
series.unique()

array([-1.13546216,  0.815127  , -2.54986995, -0.06384449, -0.38582117,
       -0.34629885, -1.50294682, -0.70059567,  0.54648847, -0.39333567,
        1.37268069, -1.56325139, -0.20098181,  3.003372  ,  1.14235507,
       30.        ,         nan])

In [106]:
series.nunique()

16

In [110]:
series = pd.Series(np.random.randn(1000));   
series[::2]=np.nan;
series.describe()   # count is 500 because describe exclude nan values

count    500.000000
mean      -0.028416
std        1.012183
min       -2.757537
25%       -0.707000
50%       -0.001703
75%        0.682951
max        2.765401
dtype: float64

In [111]:
df = pd.DataFrame(np.random.randn(1000, 5), columns=['A','B','C','D','E']);
df

            A         B         C         D         E
0   -0.085233  0.572007  0.883647 -0.961037  0.149481
1    0.637389 -0.459376  0.766702 -0.079425  0.301416
2    0.574125 -1.153262 -1.184626  0.308458 -0.433749
3    0.108784 -1.079316 -0.723660  0.682833 -0.972694
4    0.355065  0.759414 -2.513199  0.083998 -0.301174
..        ...       ...       ...       ...       ...
995 -1.694537  0.489511 -1.259743  0.977840  0.037846
996  0.484090 -1.884971  0.939263  1.468136  0.539325
997 -0.393848  0.130876  0.270772 -0.724624  0.265190
998 -1.555294  1.643853 -0.780861 -0.451087 -0.664931
999 -0.357770  0.096536 -0.454148 -1.005352  0.398168

[1000 rows x 5 columns]

In [116]:
df[::3]=np.nan;

In [117]:
df.describe()

                A           B           C           D           E
count  666.000000  666.000000  666.000000  666.000000  666.000000
mean     0.059142    0.039825   -0.079282   -0.022187   -0.001044
std      1.029433    0.989952    1.033625    0.984270    1.003749
min     -2.922336   -3.790283   -2.997893   -2.721995   -2.931607
25%     -0.654687   -0.611509   -0.800834   -0.693642   -0.709485
50%     -0.007400    0.062489   -0.057591   -0.053181   -0.012089
75%      0.757139    0.729710    0.661861    0.690729    0.692875
max      3.241443    2.960874    2.887028    3.035254    3.295200

In [120]:
df.describe(percentiles=[0.25,0.5,0.75,0.95])

                A           B           C           D           E
count  666.000000  666.000000  666.000000  666.000000  666.000000
mean     0.059142    0.039825   -0.079282   -0.022187   -0.001044
std      1.029433    0.989952    1.033625    0.984270    1.003749
min     -2.922336   -3.790283   -2.997893   -2.721995   -2.931607
25%     -0.654687   -0.611509   -0.800834   -0.693642   -0.709485
50%     -0.007400    0.062489   -0.057591   -0.053181   -0.012089
75%      0.757139    0.729710    0.661861    0.690729    0.692875
95%      1.706745    1.528569    1.548393    1.583317    1.701731
max      3.241443    2.960874    2.887028    3.035254    3.295200

In [121]:
frame = pd.DataFrame({"a": ["Yes", "Yes", "No", "No"], "b": range(4)})
frame

     a  b
0  Yes  0
1  Yes  1
2   No  2
3   No  3

In [122]:
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [123]:
frame.describe(include='object')

          a
count     4
unique    2
top     Yes
freq      2

In [124]:
frame.describe(include='number')

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [125]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top     Yes       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

In [126]:
df

            A         B         C         D         E
0         NaN       NaN       NaN       NaN       NaN
1    0.637389 -0.459376  0.766702 -0.079425  0.301416
2    0.574125 -1.153262 -1.184626  0.308458 -0.433749
3         NaN       NaN       NaN       NaN       NaN
4    0.355065  0.759414 -2.513199  0.083998 -0.301174
..        ...       ...       ...       ...       ...
995 -1.694537  0.489511 -1.259743  0.977840  0.037846
996       NaN       NaN       NaN       NaN       NaN
997 -0.393848  0.130876  0.270772 -0.724624  0.265190
998 -1.555294  1.643853 -0.780861 -0.451087 -0.664931
999       NaN       NaN       NaN       NaN       NaN

[1000 rows x 5 columns]

In [127]:
df.idxmax()

A    212
B    728
C    241
D    107
E    448
dtype: int64

In [128]:
df.idxmax(1)

0      NaN
1        C
2        A
3      NaN
4        B
      ...
995      D
996    NaN
997      C
998      B
999    NaN
Length: 1000, dtype: object

In [129]:
df.idxmin()

A    836
B    185
C    932
D    665
E    538
dtype: int64

In [130]:
series

0           NaN
1     -0.324872
2           NaN
3      0.136358
4           NaN
         ...
995   -0.038590
996         NaN
997   -1.388650
998         NaN
999   -0.193714
Length: 1000, dtype: float64

In [131]:
series.idxmax()

225

In [133]:
series.idxmin()

869

In [134]:
df.idxmin(1)

0      NaN
1        B
2        C
3      NaN
4        C
      ...
995      A
996    NaN
997      D
998      A
999    NaN
Length: 1000, dtype: object

### value_counts

In [140]:
series = pd.Series(np.random.randint(0,7,100));
series

0     2
1     1
2     6
3     2
4     3
     ..
95    2
96    1
97    6
98    3
99    6
Length: 100, dtype: int32

In [141]:
series.value_counts()

1    22
2    19
3    16
6    14
0    11
5    10
4     8
dtype: int64

In [145]:
df1 = pd.DataFrame({"a": [1, 2, 3, 4, 2], "b": ["x", "x", "y", "y", 'x']});
df1.count()

a    5
b    5
dtype: int64

In [146]:
df1.value_counts()

a  b
2  x    2
1  x    1
3  y    1
4  y    1
dtype: int64

### Discretization and quantiling

### Discretization:

- Discretization is the process of turning continuous values into categories or bins. It's like putting these values into buckets. Imagine you have the heights of people, and you want to categorize them into "short," "average," and "tall" groups. pd.cut(). 

### Quantiling
- it uses the distribution of the data. It divides the data into equal parts, making sure each part has an equal number of values. pd.qcut()

In [16]:
heights = [150, 165, 175, 180, 160, 185, 170, 155];

In [18]:
pd.cut(heights, 3)

[(149.965, 161.667], (161.667, 173.333], (173.333, 185.0], (173.333, 185.0], (149.965, 161.667], (173.333, 185.0], (161.667, 173.333], (149.965, 161.667]]
Categories (3, interval[float64, right]): [(149.965, 161.667] < (161.667, 173.333] < (173.333, 185.0]]

In [26]:
bin_edges = [149,164,179,194];
pd.cut(heights, bins=bin_edges)

[(149, 164], (164, 179], (164, 179], (179, 194], (149, 164], (179, 194], (164, 179], (149, 164]]
Categories (3, interval[int64, right]): [(149, 164] < (164, 179] < (179, 194]]

In [27]:
pd.cut(heights, bins=bin_edges, labels=['short','average','tall'])

['short', 'average', 'average', 'tall', 'short', 'tall', 'average', 'short']
Categories (3, object): ['short' < 'average' < 'tall']

In [148]:
arr = np.random.randn(20);
arr

array([ 0.0382177 , -0.5917558 , -0.11164037,  0.49722957, -0.60880347,
        0.94345443,  2.17762162, -0.97294052, -0.41375267, -0.66122025,
       -0.60185722,  1.29881926,  0.66786638,  0.36985703,  1.21998381,
       -1.89567007, -0.81810059, -0.910908  ,  2.03395173,  0.04722751])

In [149]:
pd.cut(arr, 4)

[(-0.877, 0.141], (-0.877, 0.141], (-0.877, 0.141], (0.141, 1.159], (-0.877, 0.141], ..., (-1.9, -0.877], (-0.877, 0.141], (-1.9, -0.877], (1.159, 2.178], (-0.877, 0.141]]
Length: 20
Categories (4, interval[float64, right]): [(-1.9, -0.877] < (-0.877, 0.141] < (0.141, 1.159] < (1.159, 2.178]]

#### Quantiling

In [28]:
heights = [150, 165, 175, 180, 160, 185, 170, 155];

In [30]:
pd.qcut(heights, 3)

[(149.999, 161.667], (161.667, 173.333], (173.333, 185.0], (173.333, 185.0], (149.999, 161.667], (173.333, 185.0], (161.667, 173.333], (149.999, 161.667]]
Categories (3, interval[float64, right]): [(149.999, 161.667] < (161.667, 173.333] < (173.333, 185.0]]

In [34]:
q = [0, 0.333333, 0.66666667, 1];
pd.qcut(heights, q)

[(149.999, 161.667], (161.667, 173.333], (173.333, 185.0], (173.333, 185.0], (149.999, 161.667], (173.333, 185.0], (161.667, 173.333], (149.999, 161.667]]
Categories (3, interval[float64, right]): [(149.999, 161.667] < (161.667, 173.333] < (173.333, 185.0]]

In [36]:
pd.qcut(heights, q, labels=['short', 'average', 'tall'])

['short', 'average', 'tall', 'tall', 'short', 'tall', 'average', 'short']
Categories (3, object): ['short' < 'average' < 'tall']

In [37]:
pd.qcut(heights, [0, 0.5, 1.0], labels=['short','tall'])

['short', 'short', 'tall', 'tall', 'short', 'tall', 'tall', 'short']
Categories (2, object): ['short' < 'tall']

In [45]:
df_p = pd.DataFrame({"city_and_code": ["Chicago, IL"]})

In [53]:
type(df_p['city_and_code'])

pandas.core.series.Series

In [67]:
df_p['city_and_code'].str.split(',')[0][0]

'Chicago'

In [69]:
df_p['city_and_code'].str.split(',').str.get(0)

0    Chicago
Name: city_and_code, dtype: object

In [74]:
df = pd.read_csv('csv_like_file.txt', sep='\t')

In [ ]:
df

### DataFrame.query(expr, inplace=False, **kwargs)

In [78]:
df.query('Fare>50')

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
1,2,38,71.2833,1,1,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0

### DataFrame.assign(**kwargs)

In [80]:
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [83]:
df.assign(I_Fare = lambda x: x['Fare']*0.1)    # x['Fare']*0.1  will return a complete column, which is assigned to 
                                               #   df as column with the name of I_Fare

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5,I_Fare
0,1,22,7.2500,0,1,0,0,0,0,0,0,0.72500
1,2,38,71.2833,1,1,0,0,0,0,0,0,7.12833
2,3,26,7.9250,1,0,0,0,0,0,0,0,0.79250
3,4,35,53.1000,1,1,0,0,0,0,0,0,5.31000
4,5,35,8.0500,0,0,0,0,0,0,0,0,0.80500
5,6,28,8.4583,0,0,0,0,0,0,0,0,0.84583
6,7,54,51.8625,0,0,0,0,0,0,0,0,5.18625
7,8,2,21.0750,0,3,0,0,0,0,0,0,2.10750
8,9,27,11.1333,1,0,0,0,0,0,0,0,1.11333
9,10,14,30.0708,1,1,0,0,0,0,0,0,3.00708

### Function Application
- 1. Tablewise Function Application: pipe()
- 2. Row or Column-wise Function Application: apply()
- 3. Aggregation API: agg() and transform()
- 4. Applying Elementwise Functions: applymap()

#### 1. Tablewise Function Application: pipe()

In [111]:
def extract_city_name(df):
    df['city_name'] = df['city_and_code'].str.split(',').str.get(0);
    return df;

def add_country_name(df, country_name=None):
    df['city_and_country'] = df['city_name']+" "+country_name;
    return df;

In [112]:
df_p = pd.DataFrame({"city_and_code": ["Chicago, IL"]})

In [113]:
add_country_name(extract_city_name(df_p), country_name='US')   ### Style 1

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago       Chicago US

#### pandas encourages the second style, which is known as method chaining. pipe makes it easy to use your own or another librarys functions in method chains, alongside pandas methods.

In [115]:
## Second Style
df_p.pipe(extract_city_name).pipe(add_country_name, country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago       Chicago US

In [116]:
df_p = pd.DataFrame({"city_and_code": ["Chicago, IL","Islamabad, IS"]})

In [117]:
df_p

   city_and_code
0    Chicago, IL
1  Islamabad, IS

In [118]:
df_p.pipe(extract_city_name).pipe(add_country_name, country_name="pakistan")

   city_and_code  city_name    city_and_country
0    Chicago, IL    Chicago    Chicago pakistan
1  Islamabad, IS  Islamabad  Islamabad pakistan

#### 2. Row or Column-wise Function Application: apply()
- df.apply method is used to apply user define function or built in function to DataFrame or Series.
- It is different from Aggregation API
- Aggregation API can call multiple function at the same time while df.apply function execute only single function to the DataFrame or Series at any given time.

In [119]:
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [121]:
df.apply(np.mean)

P_id       5.50000
Age       28.10000
Fare      27.02082
Sex        0.50000
sibsp      0.70000
zero       0.00000
zero.1     0.00000
zero.2     0.00000
zero.3     0.00000
zero.4     0.00000
zero.5     0.00000
dtype: float64

In [122]:
df.apply(np.mean, axis=1)

0     2.840909
1    10.298482
2     3.447727
3     8.554545
4     4.368182
5     3.859845
6    10.260227
7     3.097727
8     4.375755
9     5.097345
dtype: float64

In [124]:
df.apply(np.mean, axis='columns')

0     2.840909
1    10.298482
2     3.447727
3     8.554545
4     4.368182
5     3.859845
6    10.260227
7     3.097727
8     4.375755
9     5.097345
dtype: float64

In [125]:
df.apply(np.max)

P_id      10.0000
Age       54.0000
Fare      71.2833
Sex        1.0000
sibsp      3.0000
zero       0.0000
zero.1     0.0000
zero.2     0.0000
zero.3     0.0000
zero.4     0.0000
zero.5     0.0000
dtype: float64

In [126]:
df.apply(max)

P_id      10.0000
Age       54.0000
Fare      71.2833
Sex        1.0000
sibsp      3.0000
zero       0.0000
zero.1     0.0000
zero.2     0.0000
zero.3     0.0000
zero.4     0.0000
zero.5     0.0000
dtype: float64

In [127]:
df.apply(lambda x: x.max() - x.min())

P_id       9.0000
Age       52.0000
Fare      64.0333
Sex        1.0000
sibsp      3.0000
zero       0.0000
zero.1     0.0000
zero.2     0.0000
zero.3     0.0000
zero.4     0.0000
zero.5     0.0000
dtype: float64

In [128]:
df.apply(np.cumsum)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,3,60,78.5333,1,2,0,0,0,0,0,0
2,6,86,86.4583,2,2,0,0,0,0,0,0
3,10,121,139.5583,3,3,0,0,0,0,0,0
4,15,156,147.6083,3,3,0,0,0,0,0,0
5,21,184,156.0666,3,3,0,0,0,0,0,0
6,28,238,207.9291,3,3,0,0,0,0,0,0
7,36,240,229.0041,3,6,0,0,0,0,0,0
8,45,267,240.1374,4,6,0,0,0,0,0,0
9,55,281,270.2082,5,7,0,0,0,0,0,0

In [176]:
series = pd.Series({'Age':np.array([23,34,26,70,18,37,62,48,36,74])});

In [141]:
series

Age    [23, 34, 26, 70, 18, 37, 62, 48, 36, 74]
dtype: object

In [142]:
series.apply(np.mean)

Age    42.8
dtype: float64

In [143]:
series.apply(np.cumsum)

Age    [23, 57, 83, 153, 171, 208, 270, 318, 354, 428]
dtype: object

In [144]:
df.apply(np.exp)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,2.718282,3.584913e+09,1.408105e+03,1.000000,2.718282,1.0,1.0,1.0,1.0,1.0,1.0
1,7.389056,3.185593e+16,9.077031e+30,2.718282,2.718282,1.0,1.0,1.0,1.0,1.0,1.0
2,20.085537,1.957296e+11,2.765564e+03,2.718282,1.000000,1.0,1.0,1.0,1.0,1.0,1.0
3,54.598150,1.586013e+15,1.150898e+23,2.718282,2.718282,1.0,1.0,1.0,1.0,1.0,1.0
4,148.413159,1.586013e+15,3.133795e+03,1.000000,1.000000,1.0,1.0,1.0,1.0,1.0,1.0
5,403.428793,1.446257e+12,4.714037e+03,1.000000,1.000000,1.0,1.0,1.0,1.0,1.0,1.0
6,1096.633158,2.830753e+23,3.338855e+22,1.000000,1.000000,1.0,1.0,1.0,1.0,1.0,1.0
7,2980.957987,7.389056e+00,1.421531e+09,1.000000,20.085537,1.0,1.0,1.0,1.0,1.0,1.0
8,8103.083928,5.320482e+11,6.841176e+04,2.718282,1.000000,1.0,1.0,1.0,1.0,1.0,1.0
9,22026.465795,1.202604e+06,1.147050e+13,2.718282,2.718282,1.0,1.0,1.0,1.0,1.0,1.0

In [146]:
np.exp(series['Age'])

array([9.74480345e+09, 5.83461743e+14, 1.95729609e+11, 2.51543867e+30,
       6.56599691e+07, 1.17191424e+16, 8.43835667e+26, 7.01673591e+20,
       4.31123155e+15, 1.37338298e+32])

In [149]:
pd.Series(series['Age']).apply(np.exp)

0    9.744803e+09
1    5.834617e+14
2    1.957296e+11
3    2.515439e+30
4    6.565997e+07
5    1.171914e+16
6    8.438357e+26
7    7.016736e+20
8    4.311232e+15
9    1.373383e+32
dtype: float64

In [150]:
tsdf = pd.DataFrame(np.random.randn(1000,3), columns=['A','B','C'], index=pd.date_range('1/1/2000', periods=1000));

In [151]:
tsdf

                   A         B         C
2000-01-01  0.873098  0.500040  2.329779
2000-01-02  0.178956  0.592694  1.762367
2000-01-03 -0.603124  0.293015  0.002597
2000-01-04  0.469586  0.465787  0.277037
2000-01-05  1.730490 -2.842251 -0.499767
...              ...       ...       ...
2002-09-22  2.006757  0.874772  0.730926
2002-09-23  0.110075 -0.746900  0.179291
2002-09-24  0.388551 -0.103440  1.911278
2002-09-25 -0.675287 -1.551398 -0.243985
2002-09-26 -0.054909  0.114476  0.646799

[1000 rows x 3 columns]

In [152]:
tsdf.apply(lambda x: x.idxmax())

A   2001-05-17
B   2001-08-25
C   2001-08-16
dtype: datetime64[ns]

In [154]:
tsdf.idxmax()

A   2001-05-17
B   2001-08-25
C   2001-08-16
dtype: datetime64[ns]

In [155]:
# Additional argument
def sub_divede(x, sub, divide=0):
    return (x-sub)/divide;

In [168]:
tsdf.apply(sub_divede, sub=5, divide=3)

                   A         B         C
2000-01-01 -1.375634 -1.499987 -0.890074
2000-01-02 -1.607015 -1.469102 -1.079211
2000-01-03 -1.867708 -1.568995 -1.665801
2000-01-04 -1.510138 -1.511404 -1.574321
2000-01-05 -1.089837 -2.614084 -1.833256
...              ...       ...       ...
2002-09-22 -0.997748 -1.375076 -1.423025
2002-09-23 -1.629975 -1.915633 -1.606903
2002-09-24 -1.537150 -1.701147 -1.029574
2002-09-25 -1.891762 -2.183799 -1.747995
2002-09-26 -1.684970 -1.628508 -1.451067

[1000 rows x 3 columns]

In [162]:
(tsdf-5)/3

                   A         B         C
2000-01-01 -1.375634 -1.499987 -0.890074
2000-01-02 -1.607015 -1.469102 -1.079211
2000-01-03 -1.867708 -1.568995 -1.665801
2000-01-04 -1.510138 -1.511404 -1.574321
2000-01-05 -1.089837 -2.614084 -1.833256
...              ...       ...       ...
2002-09-22 -0.997748 -1.375076 -1.423025
2002-09-23 -1.629975 -1.915633 -1.606903
2002-09-24 -1.537150 -1.701147 -1.029574
2002-09-25 -1.891762 -2.183799 -1.747995
2002-09-26 -1.684970 -1.628508 -1.451067

[1000 rows x 3 columns]

In [169]:
series

Age    [23, 34, 26, 70, 18, 37, 62, 48, 36, 74]
dtype: object

In [177]:
pd.Series(series['Age']).interpolate()

0    23
1    34
2    26
3    70
4    18
5    37
6    62
7    48
8    36
9    74
dtype: int32

#### 3. Aggregation API

In [2]:
tsdf = pd.DataFrame(np.random.randn(10,3), index=pd.date_range('1/1/2023', periods=10), columns=['A','B','C']);
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04  1.175815  1.239061  0.753319
2023-01-05  0.342568 -0.747401 -0.471154
2023-01-06 -2.155231 -0.091588  0.927949
2023-01-07  0.483456 -0.971680 -2.223198
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [3]:
tsdf.iloc[3:7]=np.nan

In [4]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04       NaN       NaN       NaN
2023-01-05       NaN       NaN       NaN
2023-01-06       NaN       NaN       NaN
2023-01-07       NaN       NaN       NaN
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [5]:
tsdf.apply(pd.Series.interpolate)

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04  0.525630 -0.149024 -1.060628
2023-01-05  0.322196 -0.311518 -0.771168
2023-01-06  0.118762 -0.474013 -0.481708
2023-01-07 -0.084671 -0.636507 -0.192248
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [6]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04       NaN       NaN       NaN
2023-01-05       NaN       NaN       NaN
2023-01-06       NaN       NaN       NaN
2023-01-07       NaN       NaN       NaN
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [7]:
tsdf.agg(np.sum)

A   -0.455932
B    0.109713
C   -1.817401
dtype: float64

In [8]:
tsdf.agg(np.exp)

                   A         B         C
2023-01-01  0.216539  5.682046  4.065822
2023-01-02  0.586490  0.501947  0.549993
2023-01-03  2.073138  1.013561  0.259217
2023-01-04       NaN       NaN       NaN
2023-01-05       NaN       NaN       NaN
2023-01-06       NaN       NaN       NaN
2023-01-07       NaN       NaN       NaN
2023-01-08  0.749683  0.449778  1.102094
2023-01-09  3.600728  1.571688  0.783688
2023-01-10  0.891862  0.546098  0.324475

In [9]:
tsdf.agg('sum')

A   -0.455932
B    0.109713
C   -1.817401
dtype: float64

In [10]:
tsdf['A'].agg('sum')

-0.4559320492961533

In [11]:
tsdf['B'].agg(np.cumsum)

2023-01-01    1.737311
2023-01-02    1.048051
2023-01-03    1.061521
2023-01-04         NaN
2023-01-05         NaN
2023-01-06         NaN
2023-01-07         NaN
2023-01-08    0.262520
2023-01-09    0.714670
2023-01-10    0.109713
Freq: D, Name: B, dtype: float64

#### Aggregation with multiple functions

In [12]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04       NaN       NaN       NaN
2023-01-05       NaN       NaN       NaN
2023-01-06       NaN       NaN       NaN
2023-01-07       NaN       NaN       NaN
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [13]:
tsdf.iloc[3:7] = tsdf.iloc[2]

In [14]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04  0.729063  0.013470 -1.350088
2023-01-05  0.729063  0.013470 -1.350088
2023-01-06  0.729063  0.013470 -1.350088
2023-01-07  0.729063  0.013470 -1.350088
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [16]:
tsdf.iloc[3:5, 1:] = np.nan

In [17]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470 -1.350088
2023-01-07  0.729063  0.013470 -1.350088
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [19]:
tsdf.agg(['max','min','mean'])

             A         B         C
max   1.281136  1.737311  1.402616
min  -1.529983 -0.799001 -1.350088
mean  0.246032  0.017082 -0.564697

In [22]:
tsdf.agg([np.max, np.min])

             A         B         C
amax  1.281136  1.737311  1.402616
amin -1.529983 -0.799001 -1.350088

In [23]:
tsdf.agg([np.exp])

                   A         B         C
                 exp       exp       exp
2023-01-01  0.216539  5.682046  4.065822
2023-01-02  0.586490  0.501947  0.549993
2023-01-03  2.073138  1.013561  0.259217
2023-01-04  2.073138       NaN       NaN
2023-01-05  2.073138       NaN       NaN
2023-01-06  2.073138  1.013561  0.259217
2023-01-07  2.073138  1.013561  0.259217
2023-01-08  0.749683  0.449778  1.102094
2023-01-09  3.600728  1.571688  0.783688
2023-01-10  0.891862  0.546098  0.324475

In [24]:
tsdf.agg(['sum',lambda x: x.mean()])

                 A         B         C
sum       2.460321  0.136653 -4.517577
<lambda>  0.246032  0.017082 -0.564697

In [26]:
tsdf.agg({'A':'mean', 'B':'max'})

A    0.246032
B    1.737311
dtype: float64

In [29]:
tsdf.agg({'A':'std', 'B':'mean'})

A    0.844284
B    0.017082
dtype: float64

In [30]:
tsdf.agg({'A':['mean','min','max','sum']})

             A
mean  0.246032
min  -1.529983
max   1.281136
sum   2.460321

In [32]:
tsdf.agg({'A':['mean']})

             A
mean  0.246032

In [33]:
mdf = pd.DataFrame(
    {
        "A": [1, 2, 3],
        "B": [1.0, 2.0, 3.0],
        "C": ["foo", "bar", "baz"],
        "D": pd.date_range("20130101", periods=3),
    }
);

mdf

   A    B    C          D
0  1  1.0  foo 2013-01-01
1  2  2.0  bar 2013-01-02
2  3  3.0  baz 2013-01-03

In [34]:
mdf.agg(['mean','max'])

C:\Users\ABBAS\AppData\Local\Temp\ipykernel_4476\4284301388.py:1: FutureWarning: ['C'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  mdf.agg(['mean','max'])

        A    B    C          D
mean  2.0  2.0  NaN 2013-01-02
max   3.0  3.0  foo 2013-01-03

In [35]:
mdf.agg(['sum','min'])

C:\Users\ABBAS\AppData\Local\Temp\ipykernel_4476\3814040761.py:1: FutureWarning: ['D'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  mdf.agg(['sum','min'])

     A    B          C          D
sum  6  6.0  foobarbaz        NaT
min  1  1.0        bar 2013-01-01

In [36]:
tsdf.describe()

               A         B         C
count  10.000000  8.000000  8.000000
mean    0.246032  0.017082 -0.564697
std     0.844284  0.819439  0.969361
min    -1.529983 -0.799001 -1.350088
25%    -0.244690 -0.626033 -1.350088
50%     0.729063  0.013470 -0.861698
75%     0.729063  0.123140 -0.158505
max     1.281136  1.737311  1.402616

In [37]:
from functools import partial;

In [45]:
q_25 = partial(pd.Series.quantile, q=0.25);
q_25.__name__ = "25%";
q_75 = partial(pd.Series.quantile, q=0.75);
q_75.__name__ = "0.75%";

tsdf.agg(['mean', 'max', 'min', q_25, q_75, 'median', 'std', 'count'])

                A         B         C
mean     0.246032  0.017082 -0.564697
max      1.281136  1.737311  1.402616
min     -1.529983 -0.799001 -1.350088
25%     -0.244690 -0.626033 -1.350088
0.75%    0.729063  0.123140 -0.158505
median   0.729063  0.013470 -0.861698
std      0.844284  0.819439  0.969361
count   10.000000  8.000000  8.000000

### Transform API

In [46]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470 -1.350088
2023-01-07  0.729063  0.013470 -1.350088
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [49]:
tsdf.transform(np.abs)

                   A         B         C
2023-01-01  1.529983  1.737311  1.402616
2023-01-02  0.533599  0.689260  0.597850
2023-01-03  0.729063  0.013470  1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470  1.350088
2023-01-07  0.729063  0.013470  1.350088
2023-01-08  0.288105  0.799001  0.097212
2023-01-09  1.281136  0.452150  0.243744
2023-01-10  0.114444  0.604957  1.125547

In [50]:
tsdf.transform([np.abs])

                   A         B         C
            absolute  absolute  absolute
2023-01-01  1.529983  1.737311  1.402616
2023-01-02  0.533599  0.689260  0.597850
2023-01-03  0.729063  0.013470  1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470  1.350088
2023-01-07  0.729063  0.013470  1.350088
2023-01-08  0.288105  0.799001  0.097212
2023-01-09  1.281136  0.452150  0.243744
2023-01-10  0.114444  0.604957  1.125547

In [52]:
tsdf.transform('abs')

                   A         B         C
2023-01-01  1.529983  1.737311  1.402616
2023-01-02  0.533599  0.689260  0.597850
2023-01-03  0.729063  0.013470  1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470  1.350088
2023-01-07  0.729063  0.013470  1.350088
2023-01-08  0.288105  0.799001  0.097212
2023-01-09  1.281136  0.452150  0.243744
2023-01-10  0.114444  0.604957  1.125547

In [53]:
tsdf.transform(lambda x: x.abs())

                   A         B         C
2023-01-01  1.529983  1.737311  1.402616
2023-01-02  0.533599  0.689260  0.597850
2023-01-03  0.729063  0.013470  1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470  1.350088
2023-01-07  0.729063  0.013470  1.350088
2023-01-08  0.288105  0.799001  0.097212
2023-01-09  1.281136  0.452150  0.243744
2023-01-10  0.114444  0.604957  1.125547

In [54]:
tsdf.transform(['abs', lambda x: x+1])

                   A                   B                   C
                 abs  <lambda>       abs  <lambda>       abs  <lambda>
2023-01-01  1.529983 -0.529983  1.737311  2.737311  1.402616  2.402616
2023-01-02  0.533599  0.466401  0.689260  0.310740  0.597850  0.402150
2023-01-03  0.729063  1.729063  0.013470  1.013470  1.350088 -0.350088
2023-01-04  0.729063  1.729063       NaN       NaN       NaN       NaN
2023-01-05  0.729063  1.729063       NaN       NaN       NaN       NaN
2023-01-06  0.729063  1.729063  0.013470  1.013470  1.350088 -0.350088
2023-01-07  0.729063  1.729063  0.013470  1.013470  1.350088 -0.350088
2023-01-08  0.288105  0.711895  0.799001  0.200999  0.097212  1.097212
2023-01-09  1.281136  2.281136  0.452150  1.452150  0.243744  0.756256
2023-01-10  0.114444  0.885556  0.604957  0.395043  1.125547 -0.125547

In [55]:
tsdf['A'].transform('abs')

2023-01-01    1.529983
2023-01-02    0.533599
2023-01-03    0.729063
2023-01-04    0.729063
2023-01-05    0.729063
2023-01-06    0.729063
2023-01-07    0.729063
2023-01-08    0.288105
2023-01-09    1.281136
2023-01-10    0.114444
Freq: D, Name: A, dtype: float64

In [56]:
tsdf['A'].transform(['abs', lambda x: x+2])

                 abs  <lambda>
2023-01-01  1.529983  0.470017
2023-01-02  0.533599  1.466401
2023-01-03  0.729063  2.729063
2023-01-04  0.729063  2.729063
2023-01-05  0.729063  2.729063
2023-01-06  0.729063  2.729063
2023-01-07  0.729063  2.729063
2023-01-08  0.288105  1.711895
2023-01-09  1.281136  3.281136
2023-01-10  0.114444  1.885556

### 4. Applying elementwise functions

In [57]:
tsdf

                   A         B         C
2023-01-01 -1.529983  1.737311  1.402616
2023-01-02 -0.533599 -0.689260 -0.597850
2023-01-03  0.729063  0.013470 -1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470 -1.350088
2023-01-07  0.729063  0.013470 -1.350088
2023-01-08 -0.288105 -0.799001  0.097212
2023-01-09  1.281136  0.452150 -0.243744
2023-01-10 -0.114444 -0.604957 -1.125547

In [61]:
def absolute(x):
    return abs(x);

tsdf.applymap(absolute)

                   A         B         C
2023-01-01  1.529983  1.737311  1.402616
2023-01-02  0.533599  0.689260  0.597850
2023-01-03  0.729063  0.013470  1.350088
2023-01-04  0.729063       NaN       NaN
2023-01-05  0.729063       NaN       NaN
2023-01-06  0.729063  0.013470  1.350088
2023-01-07  0.729063  0.013470  1.350088
2023-01-08  0.288105  0.799001  0.097212
2023-01-09  1.281136  0.452150  0.243744
2023-01-10  0.114444  0.604957  1.125547

In [62]:
tsdf['A'].map(absolute)

2023-01-01    1.529983
2023-01-02    0.533599
2023-01-03    0.729063
2023-01-04    0.729063
2023-01-05    0.729063
2023-01-06    0.729063
2023-01-07    0.729063
2023-01-08    0.288105
2023-01-09    1.281136
2023-01-10    0.114444
Freq: D, Name: A, dtype: float64

In [66]:
def percent10(x):
    return x/100*10;

tsdf.applymap(percent10)

                   A         B         C
2023-01-01 -0.152998  0.173731  0.140262
2023-01-02 -0.053360 -0.068926 -0.059785
2023-01-03  0.072906  0.001347 -0.135009
2023-01-04  0.072906       NaN       NaN
2023-01-05  0.072906       NaN       NaN
2023-01-06  0.072906  0.001347 -0.135009
2023-01-07  0.072906  0.001347 -0.135009
2023-01-08 -0.028810 -0.079900  0.009721
2023-01-09  0.128114  0.045215 -0.024374
2023-01-10 -0.011444 -0.060496 -0.112555

In [67]:
pd.Series([1000,2000,3000,4000,5000]).map(percent10)

0    100.0
1    200.0
2    300.0
3    400.0
4    500.0
dtype: float64

In [68]:
s = pd.Series(['six', 'seven', 'eight', 'six', 'seven', 'six'], index = ['a','b','c','d','e','f']);
t = pd.Series({'six':6, 'seven':7, 'eight':8});

In [69]:
s

a      six
b    seven
c    eight
d      six
e    seven
f      six
dtype: object

In [70]:
t

six      6
seven    7
eight    8
dtype: int64

In [71]:
s.map(t)

a    6
b    7
c    8
d    6
e    7
f    6
dtype: int64

## Iteration

In [72]:
df = pd.DataFrame({'col1':np.random.randn(10), 'col2':np.random.randn(10)});
df

       col1      col2
0  0.097818 -1.071571
1  1.088395 -0.218814
2  0.047566  0.661098
3 -0.834601 -1.184312
4 -1.417343  1.492081
5 -1.106487  2.893409
6 -0.456320  0.020921
7  1.245644  1.680141
8  0.517398  0.258397
9  0.196468  0.523256

In [73]:
for col in df:
    print(col)

col1
col2

In [77]:
for col in df:
    print(df[col])

0    0.097818
1    1.088395
2    0.047566
3   -0.834601
4   -1.417343
5   -1.106487
6   -0.456320
7    1.245644
8    0.517398
9    0.196468
Name: col1, dtype: float64
0   -1.071571
1   -0.218814
2    0.661098
3   -1.184312
4    1.492081
5    2.893409
6    0.020921
7    1.680141
8    0.258397
9    0.523256
Name: col2, dtype: float64

In [78]:
for val in df['col1']:
    print(val)

0.09781829849259699
1.0883951533570317
0.047565729697116345
-0.8346011520495474
-1.4173433899903862
-1.106487476346773
-0.4563200191699405
1.2456441109426337
0.5173981475532508
0.19646833786491694

 -  iterrows(): Iterate over the rows of a DataFrame as (index, Series) pairs. This converts the rows to Series objects, which can change the dtypes and has some performance implications.
 -  itertuples(): Iterate over the rows of a DataFrame as namedtuples of the values. This is a lot faster than iterrows(), and is in most cases preferable to use to iterate over the values of a DataFrame.

In [82]:
for index, row in df.iterrows():
    print(row)

col1    0.097818
col2   -1.071571
Name: 0, dtype: float64
col1    1.088395
col2   -0.218814
Name: 1, dtype: float64
col1    0.047566
col2    0.661098
Name: 2, dtype: float64
col1   -0.834601
col2   -1.184312
Name: 3, dtype: float64
col1   -1.417343
col2    1.492081
Name: 4, dtype: float64
col1   -1.106487
col2    2.893409
Name: 5, dtype: float64
col1   -0.456320
col2    0.020921
Name: 6, dtype: float64
col1    1.245644
col2    1.680141
Name: 7, dtype: float64
col1    0.517398
col2    0.258397
Name: 8, dtype: float64
col1    0.196468
col2    0.523256
Name: 9, dtype: float64

In [86]:
for index, row in df.iterrows():
    print(row, '\n')

col1    0.097818
col2   -1.071571
Name: 0, dtype: float64

col1    1.088395
col2   -0.218814
Name: 1, dtype: float64

col1    0.047566
col2    0.661098
Name: 2, dtype: float64

col1   -0.834601
col2   -1.184312
Name: 3, dtype: float64

col1   -1.417343
col2    1.492081
Name: 4, dtype: float64

col1   -1.106487
col2    2.893409
Name: 5, dtype: float64

col1   -0.456320
col2    0.020921
Name: 6, dtype: float64

col1    1.245644
col2    1.680141
Name: 7, dtype: float64

col1    0.517398
col2    0.258397
Name: 8, dtype: float64

col1    0.196468
col2    0.523256
Name: 9, dtype: float64

In [87]:
for t in df.itertuples():
    print(t)

Pandas(Index=0, col1=0.09781829849259699, col2=-1.0715708330281517)
Pandas(Index=1, col1=1.0883951533570317, col2=-0.21881396547241086)
Pandas(Index=2, col1=0.047565729697116345, col2=0.6610976586748942)
Pandas(Index=3, col1=-0.8346011520495474, col2=-1.1843123397928037)
Pandas(Index=4, col1=-1.4173433899903862, col2=1.4920808793739986)
Pandas(Index=5, col1=-1.106487476346773, col2=2.893409026196894)
Pandas(Index=6, col1=-0.4563200191699405, col2=0.02092140727416491)
Pandas(Index=7, col1=1.2456441109426337, col2=1.6801414862593087)
Pandas(Index=8, col1=0.5173981475532508, col2=0.25839748283482544)
Pandas(Index=9, col1=0.19646833786491694, col2=0.5232558173287565)

In [92]:
for i,c1,c2 in df.itertuples():
    print(c1,c2)

0.09781829849259699 -1.0715708330281517
1.0883951533570317 -0.21881396547241086
0.047565729697116345 0.6610976586748942
-0.8346011520495474 -1.1843123397928037
-1.4173433899903862 1.4920808793739986
-1.106487476346773 2.893409026196894
-0.4563200191699405 0.02092140727416491
1.2456441109426337 1.6801414862593087
0.5173981475532508 0.25839748283482544
0.19646833786491694 0.5232558173287565

In [97]:
for i,v in {'a':[34,53],'b':[654,23]}.items():
    print(i,v)

a [34, 53]
b [654, 23]

In [103]:
for i,v in df.items():
    print(i,v, '\n')

col1 0    0.097818
1    1.088395
2    0.047566
3   -0.834601
4   -1.417343
5   -1.106487
6   -0.456320
7    1.245644
8    0.517398
9    0.196468
Name: col1, dtype: float64

col2 0   -1.071571
1   -0.218814
2    0.661098
3   -1.184312
4    1.492081
5    2.893409
6    0.020921
7    1.680141
8    0.258397
9    0.523256
Name: col2, dtype: float64

In [105]:
for i,v in df.items():
    print(i, np.array(v).round(2));

col1 [ 0.1   1.09  0.05 -0.83 -1.42 -1.11 -0.46  1.25  0.52  0.2 ]
col2 [-1.07 -0.22  0.66 -1.18  1.49  2.89  0.02  1.68  0.26  0.52]

In [106]:
df

       col1      col2
0  0.097818 -1.071571
1  1.088395 -0.218814
2  0.047566  0.661098
3 -0.834601 -1.184312
4 -1.417343  1.492081
5 -1.106487  2.893409
6 -0.456320  0.020921
7  1.245644  1.680141
8  0.517398  0.258397
9  0.196468  0.523256

In [110]:
for i,row in df.iterrows():
    print(i)
    print(row)

0
col1    0.097818
col2   -1.071571
Name: 0, dtype: float64
1
col1    1.088395
col2   -0.218814
Name: 1, dtype: float64
2
col1    0.047566
col2    0.661098
Name: 2, dtype: float64
3
col1   -0.834601
col2   -1.184312
Name: 3, dtype: float64
4
col1   -1.417343
col2    1.492081
Name: 4, dtype: float64
5
col1   -1.106487
col2    2.893409
Name: 5, dtype: float64
6
col1   -0.456320
col2    0.020921
Name: 6, dtype: float64
7
col1    1.245644
col2    1.680141
Name: 7, dtype: float64
8
col1    0.517398
col2    0.258397
Name: 8, dtype: float64
9
col1    0.196468
col2    0.523256
Name: 9, dtype: float64

In [114]:
df1 = pd.DataFrame([[12,4.4]], columns=['int', 'floatt']);
df1

   int  floatt
0   12     4.4

In [116]:
# Note: Because iterrows() returns a Series for each row, it does not preserve dtypes across the rows (dtypes are
# preserved across columns for DataFrames)

for i,r in df1.iterrows():     
    print(i,r,sep='\n');

0
int       12.0
floatt     4.4
Name: 0, dtype: float64

In [119]:
row = next(df1.iterrows())

In [120]:
row

(0,
 int       12.0
 floatt     4.4
 Name: 0, dtype: float64)

In [121]:
for row in df1.itertuples():
    print(row)

Pandas(Index=0, int=12, floatt=4.4)

## Reindexing and altering labels

In [5]:
df = pd.DataFrame(np.random.randn(10,4), index=range(1,11), columns=['A','B','C','D']);
df

           A         B         C         D
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [8]:
df.index

RangeIndex(start=1, stop=11, step=1)

In [15]:
df.reindex(['C','B','A','D'], axis='columns')

           C         B         A         D
1  -0.002077  0.871714 -0.305864  0.246822
2  -1.015896 -0.884296  0.120291 -0.398838
3  -1.312849 -0.964320 -0.161841 -0.336880
4   0.360955  2.008809 -0.362450 -0.384558
5   0.149474  1.724136  0.433524  0.783748
6   1.516375  0.001330 -0.104987  0.277826
7   2.691612 -0.879062 -0.135976 -0.362142
8   0.450133  0.481063 -0.891512 -0.568081
9  -0.195616  0.026239  0.222830 -0.010399
10  0.263045  0.021859  2.459532  0.501098

In [16]:
df.reindex(columns=['C','D','B','A'])

           C         D         B         A
1  -0.002077  0.246822  0.871714 -0.305864
2  -1.015896 -0.398838 -0.884296  0.120291
3  -1.312849 -0.336880 -0.964320 -0.161841
4   0.360955 -0.384558  2.008809 -0.362450
5   0.149474  0.783748  1.724136  0.433524
6   1.516375  0.277826  0.001330 -0.104987
7   2.691612 -0.362142 -0.879062 -0.135976
8   0.450133 -0.568081  0.481063 -0.891512
9  -0.195616 -0.010399  0.026239  0.222830
10  0.263045  0.501098  0.021859  2.459532

In [19]:
df.reindex(index=range(10,0,-1))

           A         B         C         D
10  2.459532  0.021859  0.263045  0.501098
9   0.222830  0.026239 -0.195616 -0.010399
8  -0.891512  0.481063  0.450133 -0.568081
7  -0.135976 -0.879062  2.691612 -0.362142
6  -0.104987  0.001330  1.516375  0.277826
5   0.433524  1.724136  0.149474  0.783748
4  -0.362450  2.008809  0.360955 -0.384558
3  -0.161841 -0.964320 -1.312849 -0.336880
2   0.120291 -0.884296 -1.015896 -0.398838
1  -0.305864  0.871714 -0.002077  0.246822

In [20]:
df.reindex(columns=['A','D','C','B','E'])

           A         D         C         B   E
1  -0.305864  0.246822 -0.002077  0.871714 NaN
2   0.120291 -0.398838 -1.015896 -0.884296 NaN
3  -0.161841 -0.336880 -1.312849 -0.964320 NaN
4  -0.362450 -0.384558  0.360955  2.008809 NaN
5   0.433524  0.783748  0.149474  1.724136 NaN
6  -0.104987  0.277826  1.516375  0.001330 NaN
7  -0.135976 -0.362142  2.691612 -0.879062 NaN
8  -0.891512 -0.568081  0.450133  0.481063 NaN
9   0.222830 -0.010399 -0.195616  0.026239 NaN
10  2.459532  0.501098  0.263045  0.021859 NaN

In [22]:
df.reindex(columns=['C','D','B','A'], index=range(10,0,-1))

           C         D         B         A
10  0.263045  0.501098  0.021859  2.459532
9  -0.195616 -0.010399  0.026239  0.222830
8   0.450133 -0.568081  0.481063 -0.891512
7   2.691612 -0.362142 -0.879062 -0.135976
6   1.516375  0.277826  0.001330 -0.104987
5   0.149474  0.783748  1.724136  0.433524
4   0.360955 -0.384558  2.008809 -0.362450
3  -1.312849 -0.336880 -0.964320 -0.161841
2  -1.015896 -0.398838 -0.884296  0.120291
1  -0.002077  0.246822  0.871714 -0.305864

In [23]:
df.T

,1,2,3,4,5,6,7,8,9,10
A,-0.305864,0.120291,-0.161841,-0.362450,0.433524,-0.104987,-0.135976,-0.891512,0.222830,2.459532
B,0.871714,-0.884296,-0.964320,2.008809,1.724136,0.001330,-0.879062,0.481063,0.026239,0.021859
C,-0.002077,-1.015896,-1.312849,0.360955,0.149474,1.516375,2.691612,0.450133,-0.195616,0.263045
D,0.246822,-0.398838,-0.336880,-0.384558,0.783748,0.277826,-0.362142,-0.568081,-0.010399,0.501098

In [24]:
df.transpose()

,1,2,3,4,5,6,7,8,9,10
A,-0.305864,0.120291,-0.161841,-0.362450,0.433524,-0.104987,-0.135976,-0.891512,0.222830,2.459532
B,0.871714,-0.884296,-0.964320,2.008809,1.724136,0.001330,-0.879062,0.481063,0.026239,0.021859
C,-0.002077,-1.015896,-1.312849,0.360955,0.149474,1.516375,2.691612,0.450133,-0.195616,0.263045
D,0.246822,-0.398838,-0.336880,-0.384558,0.783748,0.277826,-0.362142,-0.568081,-0.010399,0.501098

In [25]:
rs = df.reindex(index=df.index);
rs

           A         B         C         D
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [29]:
np.all(rs.index == df.index)

True

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [31]:
type(df.columns)

pandas.core.indexes.base.Index

In [32]:
df.columns[0]

'A'

In [33]:
df.columns * 2

Index(['AA', 'BB', 'CC', 'DD'], dtype='object')

In [34]:
df.reindex(columns = df.columns*3)

    AAA  BBB  CCC  DDD
1   NaN  NaN  NaN  NaN
2   NaN  NaN  NaN  NaN
3   NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN
10  NaN  NaN  NaN  NaN

In [36]:
s = pd.Series(np.random.randn(10), index = range(20,30));
s

20    2.067219
21    1.313735
22   -0.283404
23   -1.212913
24   -0.471868
25    0.172668
26    0.239869
27   -0.470001
28   -0.177863
29   -0.187891
dtype: float64

In [38]:
s.reindex(index = range(29,19,-1))

29   -0.187891
28   -0.177863
27   -0.470001
26    0.239869
25    0.172668
24   -0.471868
23   -1.212913
22   -0.283404
21    1.313735
20    2.067219
dtype: float64

### Droping labels from an axis

In [39]:
df

           A         B         C         D
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [41]:
df.drop('A', axis='columns')

           B         C         D
1   0.871714 -0.002077  0.246822
2  -0.884296 -1.015896 -0.398838
3  -0.964320 -1.312849 -0.336880
4   2.008809  0.360955 -0.384558
5   1.724136  0.149474  0.783748
6   0.001330  1.516375  0.277826
7  -0.879062  2.691612 -0.362142
8   0.481063  0.450133 -0.568081
9   0.026239 -0.195616 -0.010399
10  0.021859  0.263045  0.501098

In [42]:
df.drop([1,2,3], axis=0)

           A         B         C         D
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [47]:
df.drop(['A','B','D'], axis='columns')

           C
1  -0.002077
2  -1.015896
3  -1.312849
4   0.360955
5   0.149474
6   1.516375
7   2.691612
8   0.450133
9  -0.195616
10  0.263045

In [50]:
df.reindex(df.columns.difference(['A','D']), axis='columns')  # Similar with df.drop(columns=['A','D'])

           B         C
1   0.871714 -0.002077
2  -0.884296 -1.015896
3  -0.964320 -1.312849
4   2.008809  0.360955
5   1.724136  0.149474
6   0.001330  1.516375
7  -0.879062  2.691612
8   0.481063  0.450133
9   0.026239 -0.195616
10  0.021859  0.263045

In [51]:
df.reindex(index=df.index.difference([1,2,3]))    # similar to df.drop(index=[1,2,3])

           A         B         C         D
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

### Renaming / mapping labels

In [52]:
df

           A         B         C         D
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [55]:
df.rename(columns=str.lower)

           a         b         c         d
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [56]:
df.rename(columns = str.capitalize)

           A         B         C         D
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [59]:
df.rename(columns = {'A':'A'*3, 'B':'B'*3, 'C':'C'*3})

         AAA       BBB       CCC         D
1  -0.305864  0.871714 -0.002077  0.246822
2   0.120291 -0.884296 -1.015896 -0.398838
3  -0.161841 -0.964320 -1.312849 -0.336880
4  -0.362450  2.008809  0.360955 -0.384558
5   0.433524  1.724136  0.149474  0.783748
6  -0.104987  0.001330  1.516375  0.277826
7  -0.135976 -0.879062  2.691612 -0.362142
8  -0.891512  0.481063  0.450133 -0.568081
9   0.222830  0.026239 -0.195616 -0.010399
10  2.459532  0.021859  0.263045  0.501098

In [65]:
df.rename(index = np.exp)

                     A         B         C         D
2.718282     -0.305864  0.871714 -0.002077  0.246822
7.389056      0.120291 -0.884296 -1.015896 -0.398838
20.085537    -0.161841 -0.964320 -1.312849 -0.336880
54.598150    -0.362450  2.008809  0.360955 -0.384558
148.413159    0.433524  1.724136  0.149474  0.783748
403.428793   -0.104987  0.001330  1.516375  0.277826
1096.633158  -0.135976 -0.879062  2.691612 -0.362142
2980.957987  -0.891512  0.481063  0.450133 -0.568081
8103.083928   0.222830  0.026239 -0.195616 -0.010399
22026.465795  2.459532  0.021859  0.263045  0.501098

### Sorting

In [2]:
df = pd.DataFrame(
{
"one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
"two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
"three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
}
)

df

        one       two     three
a  0.945760  0.277656       NaN
b  1.456344 -0.531119 -1.202058
c -1.219771 -0.890822  0.190306
d       NaN -0.141700 -0.698091

In [5]:
unsorted_df = df.reindex(index=['d','b','c','a'], columns=['three', 'two', 'one']);
unsorted_df

      three       two       one
d -0.698091 -0.141700       NaN
b -1.202058 -0.531119  1.456344
c  0.190306 -0.890822 -1.219771
a       NaN  0.277656  0.945760

In [6]:
unsorted_df.sort_index()

      three       two       one
a       NaN  0.277656  0.945760
b -1.202058 -0.531119  1.456344
c  0.190306 -0.890822 -1.219771
d -0.698091 -0.141700       NaN

In [7]:
unsorted_df.sort_index(inplace=True)

In [8]:
unsorted_df

      three       two       one
a       NaN  0.277656  0.945760
b -1.202058 -0.531119  1.456344
c  0.190306 -0.890822 -1.219771
d -0.698091 -0.141700       NaN

In [12]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d -0.698091 -0.141700       NaN
c  0.190306 -0.890822 -1.219771
b -1.202058 -0.531119  1.456344
a       NaN  0.277656  0.945760

In [13]:
unsorted_df.sort_index(ascending=False, inplace=True);
unsorted_df

      three       two       one
d -0.698091 -0.141700       NaN
c  0.190306 -0.890822 -1.219771
b -1.202058 -0.531119  1.456344
a       NaN  0.277656  0.945760

In [14]:
unsorted_df.sort_index(axis=1)

        one     three       two
d       NaN -0.698091 -0.141700
c -1.219771  0.190306 -0.890822
b  1.456344 -1.202058 -0.531119
a  0.945760       NaN  0.277656

In [16]:
unsorted_df.sort_index(axis=0)

      three       two       one
a       NaN  0.277656  0.945760
b -1.202058 -0.531119  1.456344
c  0.190306 -0.890822 -1.219771
d -0.698091 -0.141700       NaN

In [18]:
unsorted_df['one'].sort_index()

a    0.945760
b    1.456344
c   -1.219771
d         NaN
Name: one, dtype: float64

In [21]:
df.set_index('one')

                two     three
one
 0.945760  0.277656       NaN
 1.456344 -0.531119 -1.202058
-1.219771 -0.890822  0.190306
 NaN      -0.141700 -0.698091